Tekla Open API Reference for Tekla Structures 2025
BooleanConverter.ConvertTo Method
 Converts an object from the boolean type to the given destination type.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override Object ConvertTo(
	ITypeDescriptorContext context,
	CultureInfo culture,
	Object value,
	Type destinationType
)
Public Overrides Function ConvertTo (
	context As ITypeDescriptorContext,
	culture As CultureInfo,
	value As Object,
	destinationType As Type
) As Object
Parameters
context
Type: System.ComponentModel.ITypeDescriptorContext
The context.
culture
Type: System.Globalization.CultureInfo
The target culture.
value
Type: System.Object
The boolean object to be converted.
destinationType
Type: System.Type
The destination type.
Return Value
Type: Object
The given boolean object converted to the new type.
See Also
Reference
BooleanConverter Class
Tekla.Structures.Datatype Namespace